Revit 2026 API

# ElementIdTryParse Method

---

Parse the string representation of the id into a corresponding ElementId.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool TryParse(
	string idStr,
	out ElementId id
)
```
```vb
Public Shared Function TryParse (
	idStr As String,
	<OutAttribute> ByRef id As ElementId
) As Boolean
```
```cpp
public:
static bool TryParse(
	String^ idStr,
	[OutAttribute] ElementId^% id
)
```
```fsharp
static member TryParse :
        idStr : string *
        id : ElementId byref -> bool
```

#### Parameters

idStr String
    The string representation of the id to return.
id ElementId
    Out parameter set to the ElementId represented by the string.

#### Return Value

Booleantrue if the string was successfully parsed into an ElementId, false otherwise.

If the string represents [!:Autodesk::Revit::DB::Element::InvalidElementId] the id will contain it upon return. If the parse fails, the id will be undefined.

#### Reference

ElementId Class

Autodesk.Revit.DB Namespace